tslator/DualBoard-043/Board1-RPi.cydsn/Generated_Source/PSoC4/I2CIF.c
/*******************************************************************************
* File Name: I2CIF.c
* Version 3.10
*
* Description:
*  This file provides the source code to the API for the SCB Component.
*
* Note:
*
*******************************************************************************
* Copyright 2013-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "I2CIF_PVT.h"

#if (I2CIF_SCB_MODE_I2C_INC)
    #include "I2CIF_I2C_PVT.h"
#endif /* (I2CIF_SCB_MODE_I2C_INC) */

#if (I2CIF_SCB_MODE_EZI2C_INC)
    #include "I2CIF_EZI2C_PVT.h"
#endif /* (I2CIF_SCB_MODE_EZI2C_INC) */

#if (I2CIF_SCB_MODE_SPI_INC || I2CIF_SCB_MODE_UART_INC)
    #include "I2CIF_SPI_UART_PVT.h"
#endif /* (I2CIF_SCB_MODE_SPI_INC || I2CIF_SCB_MODE_UART_INC) */


/***************************************
*    Run Time Configuration Vars
***************************************/

/* Stores internal component configuration for Unconfigured mode */
#if (I2CIF_SCB_MODE_UNCONFIG_CONST_CFG)
    /* Common configuration variables */
    uint8 I2CIF_scbMode = I2CIF_SCB_MODE_UNCONFIG;
    uint8 I2CIF_scbEnableWake;
    uint8 I2CIF_scbEnableIntr;

    /* I2C configuration variables */
    uint8 I2CIF_mode;
    uint8 I2CIF_acceptAddr;

    /* SPI/UART configuration variables */
    volatile uint8 * I2CIF_rxBuffer;
    uint8  I2CIF_rxDataBits;
    uint32 I2CIF_rxBufferSize;

    volatile uint8 * I2CIF_txBuffer;
    uint8  I2CIF_txDataBits;
    uint32 I2CIF_txBufferSize;

    /* EZI2C configuration variables */
    uint8 I2CIF_numberOfAddr;
    uint8 I2CIF_subAddrSize;
#endif /* (I2CIF_SCB_MODE_UNCONFIG_CONST_CFG) */


/***************************************
*     Common SCB Vars
***************************************/

uint8 I2CIF_initVar = 0u;

#if (I2CIF_SCB_IRQ_INTERNAL)
#if !defined (CY_REMOVE_I2CIF_CUSTOM_INTR_HANDLER)
    void (*I2CIF_customIntrHandler)(void) = NULL;
#endif /* !defined (CY_REMOVE_I2CIF_CUSTOM_INTR_HANDLER) */
#endif /* (I2CIF_SCB_IRQ_INTERNAL) */


/***************************************
*    Private Function Prototypes
***************************************/

static void I2CIF_ScbEnableIntr(void);
static void I2CIF_ScbModeStop(void);
static void I2CIF_ScbModePostEnable(void);


/*******************************************************************************
* Function Name: I2CIF_Init
********************************************************************************
*
* Summary:
*  Initializes the SCB component to operate in one of the selected
*  configurations: I2C, SPI, UART or EZI2C.
*  When the configuration is set to "Unconfigured SCB", this function does
*  not do any initialization. Use mode-specific initialization APIs instead:
*  SCB_I2CInit, SCB_SpiInit, SCB_UartInit or SCB_EzI2CInit.
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void I2CIF_Init(void)
{
#if (I2CIF_SCB_MODE_UNCONFIG_CONST_CFG)
    if (I2CIF_SCB_MODE_UNCONFIG_RUNTM_CFG)
    {
        I2CIF_initVar = 0u;
    }
    else
    {
        /* Initialization was done before this function call */
    }

#elif (I2CIF_SCB_MODE_I2C_CONST_CFG)
    I2CIF_I2CInit();

#elif (I2CIF_SCB_MODE_SPI_CONST_CFG)
    I2CIF_SpiInit();

#elif (I2CIF_SCB_MODE_UART_CONST_CFG)
    I2CIF_UartInit();

#elif (I2CIF_SCB_MODE_EZI2C_CONST_CFG)
    I2CIF_EzI2CInit();

#endif /* (I2CIF_SCB_MODE_UNCONFIG_CONST_CFG) */
}


/*******************************************************************************
* Function Name: I2CIF_Enable
********************************************************************************
*
* Summary:
*  Enables the SCB component operation.
*  The SCB configuration should be not changed when the component is enabled.
*  Any configuration changes should be made after disabling the component.
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void I2CIF_Enable(void)
{
#if (I2CIF_SCB_MODE_UNCONFIG_CONST_CFG)
    /* Enable SCB block, only if it is already configured */
    if (!I2CIF_SCB_MODE_UNCONFIG_RUNTM_CFG)
    {
        I2CIF_CTRL_REG |= I2CIF_CTRL_ENABLED;

        I2CIF_ScbEnableIntr();

        /* Call PostEnable function specific to current operation mode */
        I2CIF_ScbModePostEnable();
    }
#else
    I2CIF_CTRL_REG |= I2CIF_CTRL_ENABLED;

    I2CIF_ScbEnableIntr();

    /* Call PostEnable function specific to current operation mode */
    I2CIF_ScbModePostEnable();
#endif /* (I2CIF_SCB_MODE_UNCONFIG_CONST_CFG) */
}


/*******************************************************************************
* Function Name: I2CIF_Start
********************************************************************************
*
* Summary:
*  Invokes SCB_Init() and SCB_Enable().
*  After this function call, the component is enabled and ready for operation.
*  When configuration is set to "Unconfigured SCB", the component must first be
*  initialized to operate in one of the following configurations: I2C, SPI, UART
*  or EZ I2C. Otherwise this function does not enable the component.
*
* Parameters:
*  None
*
* Return:
*  None
*
* Global variables:
*  I2CIF_initVar - used to check initial configuration, modified
*  on first function call.
*
*******************************************************************************/
void I2CIF_Start(void)
{
    if (0u == I2CIF_initVar)
    {
        I2CIF_Init();
        I2CIF_initVar = 1u; /* Component was initialized */
    }

    I2CIF_Enable();
}


/*******************************************************************************
* Function Name: I2CIF_Stop
********************************************************************************
*
* Summary:
*  Disables the SCB component and its interrupt.
*  It also disables all TX interrupt sources so as not to cause an unexpected
*  interrupt trigger because after the component is enabled, the TX FIFO 
*  is empty.
*
* Parameters:
*  None
*
* Return:
*  None
* 
*******************************************************************************/
void I2CIF_Stop(void)
{
#if (I2CIF_SCB_IRQ_INTERNAL)
    I2CIF_DisableInt();
#endif /* (I2CIF_SCB_IRQ_INTERNAL) */

