tslator/DualBoard-043/Board1-RPi.cydsn/Generated_Source/PSoC4/I2CIF.c
    /* Call Stop function specific to current operation mode */
    I2CIF_ScbModeStop();

    /* Disable SCB IP */
    I2CIF_CTRL_REG &= (uint32) ~I2CIF_CTRL_ENABLED;

    /* Disable all TX interrupt sources so as not to cause an unexpected
    * interrupt trigger because after the component is enabled, the TX FIFO
    * is empty.
    * For SCB IP v0, it is critical as it does not mask-out interrupt
    * sources when they are disabled. This can cause a code lock-up in the
    * interrupt handler because TX FIFO cannot be loaded after the block
    * is disabled.
    */
    I2CIF_SetTxInterruptMode(I2CIF_NO_INTR_SOURCES);

#if (I2CIF_SCB_IRQ_INTERNAL)
    I2CIF_ClearPendingInt();
#endif /* (I2CIF_SCB_IRQ_INTERNAL) */
}


/*******************************************************************************
* Function Name: I2CIF_SetRxFifoLevel
********************************************************************************
*
* Summary:
*  Sets level in the RX FIFO to generate a RX level interrupt.
*  When the RX FIFO has more entries than the RX FIFO level an RX level
*  interrupt request is generated.
*
* Parameters:
*  level: Level in the RX FIFO to generate RX level interrupt.
*         The range of valid level values is between 0 and RX FIFO depth - 1.
*
* Return:
*  None
*
*******************************************************************************/
void I2CIF_SetRxFifoLevel(uint32 level)
{
    uint32 rxFifoCtrl;

    rxFifoCtrl = I2CIF_RX_FIFO_CTRL_REG;

    rxFifoCtrl &= ((uint32) ~I2CIF_RX_FIFO_CTRL_TRIGGER_LEVEL_MASK); /* Clear level mask bits */
    rxFifoCtrl |= ((uint32) (I2CIF_RX_FIFO_CTRL_TRIGGER_LEVEL_MASK & level));

    I2CIF_RX_FIFO_CTRL_REG = rxFifoCtrl;
}


/*******************************************************************************
* Function Name: I2CIF_SetTxFifoLevel
********************************************************************************
*
* Summary:
*  Sets level in the TX FIFO to generate a TX level interrupt.
*  When the TX FIFO has more entries than the TX FIFO level an TX level
*  interrupt request is generated.
*
* Parameters:
*  level: Level in the TX FIFO to generate TX level interrupt.
*         The range of valid level values is between 0 and TX FIFO depth - 1.
*
* Return:
*  None
*
*******************************************************************************/
void I2CIF_SetTxFifoLevel(uint32 level)
{
    uint32 txFifoCtrl;

    txFifoCtrl = I2CIF_TX_FIFO_CTRL_REG;

    txFifoCtrl &= ((uint32) ~I2CIF_TX_FIFO_CTRL_TRIGGER_LEVEL_MASK); /* Clear level mask bits */
    txFifoCtrl |= ((uint32) (I2CIF_TX_FIFO_CTRL_TRIGGER_LEVEL_MASK & level));

    I2CIF_TX_FIFO_CTRL_REG = txFifoCtrl;
}


#if (I2CIF_SCB_IRQ_INTERNAL)
    /*******************************************************************************
    * Function Name: I2CIF_SetCustomInterruptHandler
    ********************************************************************************
    *
    * Summary:
    *  Registers a function to be called by the internal interrupt handler.
    *  First the function that is registered is called, then the internal interrupt
    *  handler performs any operation such as software buffer management functions
    *  before the interrupt returns.  It is the user's responsibility not to break
    *  the software buffer operations. Only one custom handler is supported, which
    *  is the function provided by the most recent call.
    *  At the initialization time no custom handler is registered.
    *
    * Parameters:
    *  func: Pointer to the function to register.
    *        The value NULL indicates to remove the current custom interrupt
    *        handler.
    *
    * Return:
    *  None
    *
    *******************************************************************************/
    void I2CIF_SetCustomInterruptHandler(void (*func)(void))
    {
    #if !defined (CY_REMOVE_I2CIF_CUSTOM_INTR_HANDLER)
        I2CIF_customIntrHandler = func; /* Register interrupt handler */
    #else
        if (NULL != func)
        {
            /* Suppress compiler warning */
        }
    #endif /* !defined (CY_REMOVE_I2CIF_CUSTOM_INTR_HANDLER) */
    }
#endif /* (I2CIF_SCB_IRQ_INTERNAL) */


/*******************************************************************************
* Function Name: I2CIF_ScbModeEnableIntr
********************************************************************************
*
* Summary:
*  Enables an interrupt for a specific mode.
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
static void I2CIF_ScbEnableIntr(void)
{
#if (I2CIF_SCB_IRQ_INTERNAL)
    /* Enable interrupt in NVIC */
    #if (I2CIF_SCB_MODE_UNCONFIG_CONST_CFG)
        if (0u != I2CIF_scbEnableIntr)
        {
            I2CIF_EnableInt();
        }

    #else
        I2CIF_EnableInt();

    #endif /* (I2CIF_SCB_MODE_UNCONFIG_CONST_CFG) */
#endif /* (I2CIF_SCB_IRQ_INTERNAL) */
}


/*******************************************************************************
* Function Name: I2CIF_ScbModePostEnable
********************************************************************************
*
* Summary:
*  Calls the PostEnable function for a specific operation mode.
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
static void I2CIF_ScbModePostEnable(void)
{
#if (I2CIF_SCB_MODE_UNCONFIG_CONST_CFG)
#if (!I2CIF_CY_SCBIP_V1)
    if (I2CIF_SCB_MODE_SPI_RUNTM_CFG)
    {
        I2CIF_SpiPostEnable();
    }
    else if (I2CIF_SCB_MODE_UART_RUNTM_CFG)
    {
        I2CIF_UartPostEnable();
    }
    else
    {
        /* Unknown mode: do nothing */
    }
#endif /* (!I2CIF_CY_SCBIP_V1) */

#elif (I2CIF_SCB_MODE_SPI_CONST_CFG)
    I2CIF_SpiPostEnable();

#elif (I2CIF_SCB_MODE_UART_CONST_CFG)
    I2CIF_UartPostEnable();

#else
    /* Unknown mode: do nothing */
#endif /* (I2CIF_SCB_MODE_UNCONFIG_CONST_CFG) */
}


