tslator/DualBoard-043/Board1-RPi.cydsn/Generated_Source/PSoC4/I2CIF.c
/*******************************************************************************
* Function Name: I2CIF_ScbModeStop
********************************************************************************
*
* Summary:
*  Calls the Stop function for a specific operation mode.
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
static void I2CIF_ScbModeStop(void)
{
#if (I2CIF_SCB_MODE_UNCONFIG_CONST_CFG)
    if (I2CIF_SCB_MODE_I2C_RUNTM_CFG)
    {
        I2CIF_I2CStop();
    }
    else if (I2CIF_SCB_MODE_EZI2C_RUNTM_CFG)
    {
        I2CIF_EzI2CStop();
    }
#if (!I2CIF_CY_SCBIP_V1)
    else if (I2CIF_SCB_MODE_SPI_RUNTM_CFG)
    {
        I2CIF_SpiStop();
    }
    else if (I2CIF_SCB_MODE_UART_RUNTM_CFG)
    {
        I2CIF_UartStop();
    }
#endif /* (!I2CIF_CY_SCBIP_V1) */
    else
    {
        /* Unknown mode: do nothing */
    }
#elif (I2CIF_SCB_MODE_I2C_CONST_CFG)
    I2CIF_I2CStop();

#elif (I2CIF_SCB_MODE_EZI2C_CONST_CFG)
    I2CIF_EzI2CStop();

#elif (I2CIF_SCB_MODE_SPI_CONST_CFG)
    I2CIF_SpiStop();

#elif (I2CIF_SCB_MODE_UART_CONST_CFG)
    I2CIF_UartStop();

#else
    /* Unknown mode: do nothing */
#endif /* (I2CIF_SCB_MODE_UNCONFIG_CONST_CFG) */
}


#if (I2CIF_SCB_MODE_UNCONFIG_CONST_CFG)
    /*******************************************************************************
    * Function Name: I2CIF_SetPins
    ********************************************************************************
    *
    * Summary:
    *  Sets the pins settings accordingly to the selected operation mode.
    *  Only available in the Unconfigured operation mode. The mode specific
    *  initialization function calls it.
    *  Pins configuration is set by PSoC Creator when a specific mode of operation
    *  is selected in design time.
    *
    * Parameters:
    *  mode:      Mode of SCB operation.
    *  subMode:   Sub-mode of SCB operation. It is only required for SPI and UART
    *             modes.
    *  uartEnableMask: enables TX or RX direction and RTS and CTS signals.
    *
    * Return:
    *  None
    *
    *******************************************************************************/
    void I2CIF_SetPins(uint32 mode, uint32 subMode, uint32 uartEnableMask)
    {
        uint32 hsiomSel [I2CIF_SCB_PINS_NUMBER];
        uint32 pinsDm   [I2CIF_SCB_PINS_NUMBER];

    #if (!I2CIF_CY_SCBIP_V1)
        uint32 pinsInBuf = 0u;
    #endif /* (!I2CIF_CY_SCBIP_V1) */

        uint32 i;

        /* Set default HSIOM to GPIO and Drive Mode to Analog Hi-Z */
        for (i = 0u; i < I2CIF_SCB_PINS_NUMBER; i++)
        {
            hsiomSel[i]  = I2CIF_HSIOM_DEF_SEL;
            pinsDm[i]    = I2CIF_PIN_DM_ALG_HIZ;
        }

        if ((I2CIF_SCB_MODE_I2C   == mode) ||
           (I2CIF_SCB_MODE_EZI2C == mode))
        {
            hsiomSel[I2CIF_RX_SCL_MOSI_PIN_INDEX] = I2CIF_HSIOM_I2C_SEL;
            hsiomSel[I2CIF_TX_SDA_MISO_PIN_INDEX] = I2CIF_HSIOM_I2C_SEL;

            pinsDm[I2CIF_RX_SCL_MOSI_PIN_INDEX] = I2CIF_PIN_DM_OD_LO;
            pinsDm[I2CIF_TX_SDA_MISO_PIN_INDEX] = I2CIF_PIN_DM_OD_LO;
        }
    #if (!I2CIF_CY_SCBIP_V1)
        else if (I2CIF_SCB_MODE_SPI == mode)
        {
            hsiomSel[I2CIF_RX_SCL_MOSI_PIN_INDEX] = I2CIF_HSIOM_SPI_SEL;
            hsiomSel[I2CIF_TX_SDA_MISO_PIN_INDEX] = I2CIF_HSIOM_SPI_SEL;
            hsiomSel[I2CIF_CTS_SCLK_PIN_INDEX] = I2CIF_HSIOM_SPI_SEL;

            if (I2CIF_SPI_SLAVE == subMode)
            {
                /* Slave */
                pinsDm[I2CIF_RX_SCL_MOSI_PIN_INDEX] = I2CIF_PIN_DM_DIG_HIZ;
                pinsDm[I2CIF_TX_SDA_MISO_PIN_INDEX] = I2CIF_PIN_DM_STRONG;
                pinsDm[I2CIF_CTS_SCLK_PIN_INDEX] = I2CIF_PIN_DM_DIG_HIZ;

            #if (I2CIF_RTS_SS0_PIN)
                /* Only SS0 is valid choice for Slave */
                hsiomSel[I2CIF_RTS_SS0_PIN_INDEX] = I2CIF_HSIOM_SPI_SEL;
                pinsDm  [I2CIF_RTS_SS0_PIN_INDEX] = I2CIF_PIN_DM_DIG_HIZ;
            #endif /* (I2CIF_RTS_SS0_PIN) */

            #if (I2CIF_TX_SDA_MISO_PIN)
                /* Disable input buffer */
                 pinsInBuf |= I2CIF_TX_SDA_MISO_PIN_MASK;
            #endif /* (I2CIF_TX_SDA_MISO_PIN) */
            }
            else /* (Master) */
            {
                pinsDm[I2CIF_RX_SCL_MOSI_PIN_INDEX] = I2CIF_PIN_DM_STRONG;
                pinsDm[I2CIF_TX_SDA_MISO_PIN_INDEX] = I2CIF_PIN_DM_DIG_HIZ;
                pinsDm[I2CIF_CTS_SCLK_PIN_INDEX] = I2CIF_PIN_DM_STRONG;

            #if (I2CIF_RTS_SS0_PIN)
                hsiomSel [I2CIF_RTS_SS0_PIN_INDEX] = I2CIF_HSIOM_SPI_SEL;
                pinsDm   [I2CIF_RTS_SS0_PIN_INDEX] = I2CIF_PIN_DM_STRONG;
                pinsInBuf |= I2CIF_RTS_SS0_PIN_MASK;
            #endif /* (I2CIF_RTS_SS0_PIN) */

            #if (I2CIF_SS1_PIN)
                hsiomSel [I2CIF_SS1_PIN_INDEX] = I2CIF_HSIOM_SPI_SEL;
                pinsDm   [I2CIF_SS1_PIN_INDEX] = I2CIF_PIN_DM_STRONG;
                pinsInBuf |= I2CIF_SS1_PIN_MASK;
            #endif /* (I2CIF_SS1_PIN) */

            #if (I2CIF_SS2_PIN)
                hsiomSel [I2CIF_SS2_PIN_INDEX] = I2CIF_HSIOM_SPI_SEL;
                pinsDm   [I2CIF_SS2_PIN_INDEX] = I2CIF_PIN_DM_STRONG;
                pinsInBuf |= I2CIF_SS2_PIN_MASK;
            #endif /* (I2CIF_SS2_PIN) */

            #if (I2CIF_SS3_PIN)
                hsiomSel [I2CIF_SS3_PIN_INDEX] = I2CIF_HSIOM_SPI_SEL;
                pinsDm   [I2CIF_SS3_PIN_INDEX] = I2CIF_PIN_DM_STRONG;
                pinsInBuf |= I2CIF_SS3_PIN_MASK;
            #endif /* (I2CIF_SS3_PIN) */

                /* Disable input buffers */
            #if (I2CIF_RX_SCL_MOSI_PIN)
                pinsInBuf |= I2CIF_RX_SCL_MOSI_PIN_MASK;
            #endif /* (I2CIF_RX_SCL_MOSI_PIN) */

             #if (I2CIF_RX_WAKE_SCL_MOSI_PIN)
                pinsInBuf |= I2CIF_RX_WAKE_SCL_MOSI_PIN_MASK;
            #endif /* (I2CIF_RX_WAKE_SCL_MOSI_PIN) */

            #if (I2CIF_CTS_SCLK_PIN)
                pinsInBuf |= I2CIF_CTS_SCLK_PIN_MASK;
            #endif /* (I2CIF_CTS_SCLK_PIN) */
            }
        }
        else /* UART */
        {
            if (I2CIF_UART_MODE_SMARTCARD == subMode)
            {
                /* SmartCard */
                hsiomSel[I2CIF_TX_SDA_MISO_PIN_INDEX] = I2CIF_HSIOM_UART_SEL;
                pinsDm  [I2CIF_TX_SDA_MISO_PIN_INDEX] = I2CIF_PIN_DM_OD_LO;
            }
            else /* Standard or IrDA */
            {
                if (0u != (I2CIF_UART_RX_PIN_ENABLE & uartEnableMask))
                {
                    hsiomSel[I2CIF_RX_SCL_MOSI_PIN_INDEX] = I2CIF_HSIOM_UART_SEL;
                    pinsDm  [I2CIF_RX_SCL_MOSI_PIN_INDEX] = I2CIF_PIN_DM_DIG_HIZ;
                }

                if (0u != (I2CIF_UART_TX_PIN_ENABLE & uartEnableMask))
                {
                    hsiomSel[I2CIF_TX_SDA_MISO_PIN_INDEX] = I2CIF_HSIOM_UART_SEL;
                    pinsDm  [I2CIF_TX_SDA_MISO_PIN_INDEX] = I2CIF_PIN_DM_STRONG;

