tslator/DualBoard-043/Board1-RPi.cydsn/Generated_Source/PSoC4/I2CIF.c
                #if (I2CIF_TX_SDA_MISO_PIN)
                     pinsInBuf |= I2CIF_TX_SDA_MISO_PIN_MASK;
                #endif /* (I2CIF_TX_SDA_MISO_PIN) */
                }

            #if !(I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1)
                if (I2CIF_UART_MODE_STD == subMode)
                {
                    if (0u != (I2CIF_UART_CTS_PIN_ENABLE & uartEnableMask))
                    {
                        /* CTS input is multiplexed with SCLK */
                        hsiomSel[I2CIF_CTS_SCLK_PIN_INDEX] = I2CIF_HSIOM_UART_SEL;
                        pinsDm  [I2CIF_CTS_SCLK_PIN_INDEX] = I2CIF_PIN_DM_DIG_HIZ;
                    }

                    if (0u != (I2CIF_UART_RTS_PIN_ENABLE & uartEnableMask))
                    {
                        /* RTS output is multiplexed with SS0 */
                        hsiomSel[I2CIF_RTS_SS0_PIN_INDEX] = I2CIF_HSIOM_UART_SEL;
                        pinsDm  [I2CIF_RTS_SS0_PIN_INDEX] = I2CIF_PIN_DM_STRONG;

                    #if (I2CIF_RTS_SS0_PIN)
                        /* Disable input buffer */
                        pinsInBuf |= I2CIF_RTS_SS0_PIN_MASK;
                    #endif /* (I2CIF_RTS_SS0_PIN) */
                    }
                }
            #endif /* !(I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1) */
            }
        }
    #endif /* (!I2CIF_CY_SCBIP_V1) */

    /* Configure pins: set HSIOM, DM and InputBufEnable */
    /* Note: the DR register settings do not effect the pin output if HSIOM is other than GPIO */

    #if (I2CIF_RX_WAKE_SCL_MOSI_PIN)
        I2CIF_SET_HSIOM_SEL(I2CIF_RX_WAKE_SCL_MOSI_HSIOM_REG,
                                       I2CIF_RX_WAKE_SCL_MOSI_HSIOM_MASK,
                                       I2CIF_RX_WAKE_SCL_MOSI_HSIOM_POS,
                                       hsiomSel[I2CIF_RX_WAKE_SCL_MOSI_PIN_INDEX]);

        I2CIF_uart_rx_wake_i2c_scl_spi_mosi_SetDriveMode((uint8)
                                                               pinsDm[I2CIF_RX_WAKE_SCL_MOSI_PIN_INDEX]);

        I2CIF_SET_INP_DIS(I2CIF_uart_rx_wake_i2c_scl_spi_mosi_INP_DIS,
                                     I2CIF_uart_rx_wake_i2c_scl_spi_mosi_MASK,
                                     (0u != (pinsInBuf & I2CIF_RX_WAKE_SCL_MOSI_PIN_MASK)));

         /* Set interrupt on falling edge */
        I2CIF_SET_INCFG_TYPE(I2CIF_RX_WAKE_SCL_MOSI_INTCFG_REG,
                                        I2CIF_RX_WAKE_SCL_MOSI_INTCFG_TYPE_MASK,
                                        I2CIF_RX_WAKE_SCL_MOSI_INTCFG_TYPE_POS,
                                        I2CIF_INTCFG_TYPE_FALLING_EDGE);
    #endif /* (I2CIF_RX_WAKE_SCL_MOSI_PIN) */

    #if (I2CIF_RX_SCL_MOSI_PIN)
        I2CIF_SET_HSIOM_SEL(I2CIF_RX_SCL_MOSI_HSIOM_REG,
                                       I2CIF_RX_SCL_MOSI_HSIOM_MASK,
                                       I2CIF_RX_SCL_MOSI_HSIOM_POS,
                                        hsiomSel[I2CIF_RX_SCL_MOSI_PIN_INDEX]);

        I2CIF_uart_rx_i2c_scl_spi_mosi_SetDriveMode((uint8) pinsDm[I2CIF_RX_SCL_MOSI_PIN_INDEX]);

    #if (!I2CIF_CY_SCBIP_V1)
        I2CIF_SET_INP_DIS(I2CIF_uart_rx_i2c_scl_spi_mosi_INP_DIS,
                                     I2CIF_uart_rx_i2c_scl_spi_mosi_MASK,
                                     (0u != (pinsInBuf & I2CIF_RX_SCL_MOSI_PIN_MASK)));
    #endif /* (!I2CIF_CY_SCBIP_V1) */
    #endif /* (I2CIF_RX_SCL_MOSI_PIN) */

    #if (I2CIF_TX_SDA_MISO_PIN)
        I2CIF_SET_HSIOM_SEL(I2CIF_TX_SDA_MISO_HSIOM_REG,
                                       I2CIF_TX_SDA_MISO_HSIOM_MASK,
                                       I2CIF_TX_SDA_MISO_HSIOM_POS,
                                        hsiomSel[I2CIF_TX_SDA_MISO_PIN_INDEX]);

        I2CIF_uart_tx_i2c_sda_spi_miso_SetDriveMode((uint8) pinsDm[I2CIF_TX_SDA_MISO_PIN_INDEX]);

    #if (!I2CIF_CY_SCBIP_V1)
        I2CIF_SET_INP_DIS(I2CIF_uart_tx_i2c_sda_spi_miso_INP_DIS,
                                     I2CIF_uart_tx_i2c_sda_spi_miso_MASK,
                                    (0u != (pinsInBuf & I2CIF_TX_SDA_MISO_PIN_MASK)));
    #endif /* (!I2CIF_CY_SCBIP_V1) */
    #endif /* (I2CIF_RX_SCL_MOSI_PIN) */

    #if (I2CIF_CTS_SCLK_PIN)
        I2CIF_SET_HSIOM_SEL(I2CIF_CTS_SCLK_HSIOM_REG,
                                       I2CIF_CTS_SCLK_HSIOM_MASK,
                                       I2CIF_CTS_SCLK_HSIOM_POS,
                                       hsiomSel[I2CIF_CTS_SCLK_PIN_INDEX]);

        I2CIF_uart_cts_spi_sclk_SetDriveMode((uint8) pinsDm[I2CIF_CTS_SCLK_PIN_INDEX]);

        I2CIF_SET_INP_DIS(I2CIF_uart_cts_spi_sclk_INP_DIS,
                                     I2CIF_uart_cts_spi_sclk_MASK,
                                     (0u != (pinsInBuf & I2CIF_CTS_SCLK_PIN_MASK)));
    #endif /* (I2CIF_CTS_SCLK_PIN) */

    #if (I2CIF_RTS_SS0_PIN)
        I2CIF_SET_HSIOM_SEL(I2CIF_RTS_SS0_HSIOM_REG,
                                       I2CIF_RTS_SS0_HSIOM_MASK,
                                       I2CIF_RTS_SS0_HSIOM_POS,
                                       hsiomSel[I2CIF_RTS_SS0_PIN_INDEX]);

        I2CIF_uart_rts_spi_ss0_SetDriveMode((uint8) pinsDm[I2CIF_RTS_SS0_PIN_INDEX]);

        I2CIF_SET_INP_DIS(I2CIF_uart_rts_spi_ss0_INP_DIS,
                                     I2CIF_uart_rts_spi_ss0_MASK,
                                     (0u != (pinsInBuf & I2CIF_RTS_SS0_PIN_MASK)));
    #endif /* (I2CIF_RTS_SS0_PIN) */

    #if (I2CIF_SS1_PIN)
        I2CIF_SET_HSIOM_SEL(I2CIF_SS1_HSIOM_REG,
                                       I2CIF_SS1_HSIOM_MASK,
                                       I2CIF_SS1_HSIOM_POS,
                                       hsiomSel[I2CIF_SS1_PIN_INDEX]);

        I2CIF_spi_ss1_SetDriveMode((uint8) pinsDm[I2CIF_SS1_PIN_INDEX]);

        I2CIF_SET_INP_DIS(I2CIF_spi_ss1_INP_DIS,
                                     I2CIF_spi_ss1_MASK,
                                     (0u != (pinsInBuf & I2CIF_SS1_PIN_MASK)));
    #endif /* (I2CIF_SS1_PIN) */

    #if (I2CIF_SS2_PIN)
        I2CIF_SET_HSIOM_SEL(I2CIF_SS2_HSIOM_REG,
                                       I2CIF_SS2_HSIOM_MASK,
                                       I2CIF_SS2_HSIOM_POS,
                                       hsiomSel[I2CIF_SS2_PIN_INDEX]);

        I2CIF_spi_ss2_SetDriveMode((uint8) pinsDm[I2CIF_SS2_PIN_INDEX]);

        I2CIF_SET_INP_DIS(I2CIF_spi_ss2_INP_DIS,
                                     I2CIF_spi_ss2_MASK,
                                     (0u != (pinsInBuf & I2CIF_SS2_PIN_MASK)));
    #endif /* (I2CIF_SS2_PIN) */

    #if (I2CIF_SS3_PIN)
        I2CIF_SET_HSIOM_SEL(I2CIF_SS3_HSIOM_REG,
                                       I2CIF_SS3_HSIOM_MASK,
                                       I2CIF_SS3_HSIOM_POS,
                                       hsiomSel[I2CIF_SS3_PIN_INDEX]);

