tslator/DualBoard-043/Board1-RPi.cydsn/Generated_Source/PSoC4/I2CIF.c
        I2CIF_spi_ss3_SetDriveMode((uint8) pinsDm[I2CIF_SS3_PIN_INDEX]);

        I2CIF_SET_INP_DIS(I2CIF_spi_ss3_INP_DIS,
                                     I2CIF_spi_ss3_MASK,
                                     (0u != (pinsInBuf & I2CIF_SS3_PIN_MASK)));
    #endif /* (I2CIF_SS3_PIN) */
    }

#endif /* (I2CIF_SCB_MODE_UNCONFIG_CONST_CFG) */


#if (I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1)
    /*******************************************************************************
    * Function Name: I2CIF_I2CSlaveNackGeneration
    ********************************************************************************
    *
    * Summary:
    *  Sets command to generate NACK to the address or data.
    *
    * Parameters:
    *  None
    *
    * Return:
    *  None
    *
    *******************************************************************************/
    void I2CIF_I2CSlaveNackGeneration(void)
    {
        /* Check for EC_AM toggle condition: EC_AM and clock stretching for address are enabled */
        if ((0u != (I2CIF_CTRL_REG & I2CIF_CTRL_EC_AM_MODE)) &&
            (0u == (I2CIF_I2C_CTRL_REG & I2CIF_I2C_CTRL_S_NOT_READY_ADDR_NACK)))
        {
            /* Toggle EC_AM before NACK generation */
            I2CIF_CTRL_REG &= ~I2CIF_CTRL_EC_AM_MODE;
            I2CIF_CTRL_REG |=  I2CIF_CTRL_EC_AM_MODE;
        }

        I2CIF_I2C_SLAVE_CMD_REG = I2CIF_I2C_SLAVE_CMD_S_NACK;
    }
#endif /* (I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1) */


/* [] END OF FILE */
